{"sections":[{"id":"01-what-is-quantum","title":"0.1 What is Quantum?","status":"","translated":"","background":"","goals":0,"duration":10,"steps":["step-0","step-1"]},{"id":"02-prerequisites","title":"0.2 Prerequisites","status":"","translated":"","background":"","goals":0,"duration":5,"steps":["step-2"]}],"steps":[{"id":"step-0","section":"01-what-is-quantum","goals":[],"html":"<x-step id=\"step-0\" goals=\"\"><p><span class=\"sentence\">‘Quantum physics’ is a term widely used, but much less understood. </span><span class=\"sentence\">It is a mathematical model first used to describe the behaviour of small things in a laboratory, which exposed gaps in the preceding theory of ‘classical’ physics. </span><span class=\"sentence\">Quantum theory explains this behaviour and gives us a more complete picture of our universe. </span><span class=\"sentence\">We have realised we can use this previously unexplained behaviour to perform certain computations which we previously did not believe possible. </span><span class=\"sentence\">We call this quantum computing.</span></p><p><span class=\"sentence\">Quantum computing is the perfect way to dip your toes into quantum physics. </span><span class=\"sentence\">It distils the core concepts from quantum physics into their simplest forms, stripping away the complications of the physical world. </span><span class=\"sentence\">This page will take you on a short journey to discover (and explain!) some strange quantum phenomena, and give you a taste for what ‘quantum’ is.</span></p></x-step>"},{"id":"step-1","section":"01-what-is-quantum","goals":[],"html":"<x-step id=\"step-1\" goals=\"\"><h2>Review of Classical Probability</h2><p><span class=\"sentence\">To cover quantum phenomena, we need to first remind ourselves of 'classical' probabilities. </span><span class=\"sentence\">In this sense, 'classical' just means pre-quantum, i.e. </span><span class=\"sentence\">the normal probability trees you should have seen in school. </span><span class=\"sentence\">If you're already familiar with this material, you should move through it quickly. </span><span class=\"sentence\">If you're not so hot on this then don't worry- we'll only cover some of the simplest probability problems possible.</span></p><h3>Probability Trees</h3><p><span class=\"sentence\">You will hopefully remember probability trees from school. </span><span class=\"sentence\">The idea is simple, we use a drawing to map out every possible eventuality and from this, we can calculate the chance of it happening.</span></p><p><span class=\"sentence\">Say we have a coin, and to start we place it in the state Heads. </span><span class=\"sentence\">If we then toss this fair coin and look at it, there is a 50% chance we will see Heads again, and a 50% chance of seeing Tails instead. </span><span class=\"sentence\">We can plot this on a probability tree like so:</span></p><p><img src=\"https://qiskit.org/textbook/images/whatis/whatis1.png\" alt=\"\"></p><p><span class=\"sentence\">We draw the outcomes on the end of each branch, and the probabilities of each occurrence on the branches. </span><span class=\"sentence\">Similarly, if we started in the state Tails and tossed the coin, we would have a 50% chance of seeing Heads and a 50% chance of seeing tails.</span></p><p><img src=\"https://qiskit.org/textbook/images/whatis/whatis2.png\" alt=\"\"></p><p><span class=\"sentence\">We can test this works is by trying it. </span><span class=\"sentence\">You can physically get a coin out, flip it many times, and record each result; you will eventually see roughly 50% of your results are Heads and 50% tails. </span><span class=\"sentence\">Around 500 to 1000 tosses should be enough to get reliable results.</span></p><h3>Experiment #1: Single Coin Toss</h3><p><span class=\"sentence\">Too lazy to try this? </span><span class=\"sentence\">Don’t worry! </span><span class=\"sentence\">You can simulate the coin-tossing experiment by pressing the Toss Coin button below to simulate a coin toss and store the results. </span><span class=\"sentence\">You can change the initial state to 'Heads' or 'Tails', or increase the number of coins (No. </span><span class=\"sentence\">of Coins) slider to get many results quickly. </span><span class=\"sentence\">Click Reset to discard your results and start again.</span></p></x-step>"},{"id":"step-2","section":"02-prerequisites","goals":[],"html":"<x-step id=\"step-2\" goals=\"\"><p><span class=\"sentence\">TODO</span></p></x-step>"}],"goals":0,"title":"0. Getting Started"}